// 1초, 256MB, 2*n 타일링
// 2*n을 1*2, 2*1 타일로 체우는 방법 경우의 수 구하기 (%10,007)
// 1 <= n <= 1,000

int dp[1001];

int main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL); cout.tie(NULL);
    int n;
    cin >> n;
    // 1 => 1
    // 2 => 11, 22
    // 3 => 111, 122, 221
    // 4 => 1111, 2222, 1221, 2211, 1122
    // 5 => 11111, 22221, 12222, 22122, 11122, 11221, 122111, 22111
    // 맨왼쪽 칸을 기준으로 1로 체울지 2로 체울지에 따라 달라짐
    // 맨왼쪽 1이면 -> dp[n-1]
    // 맨왼쪽 2이면 -> dp[n-2]
    // dp[n] = dp[n-1] + dp[n-2]
    dp[1] = 1; dp[2] = 2;
    for(int i = 3; i <= n; i++){
        dp[i] = (dp[i-1] + dp[i-2]) % 10007;
    }

    cout << dp[n];
    return 0;
}
